app/controllers/articles_controller.rb

  def index
    if params[:query]
      @articles = Article.search(params[:query]).records
---
SELECT "articles".* FROM "articles"

  def create
    @article = Article.new(article_params)

    respond_to do |format|
      if @article.save
---
INSERT INTO "articles" ("name", "body", "related_to", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "name1"], ["body", "body1"], ["related_to", "related_to_1"], ["created_at", "2020-09-18 09:37:37.871355"], ["updated_at", "2020-09-18 09:37:37.871355"]]

  def update
    respond_to do |format|
      if @article.update(article_params)
---
UPDATE "articles" SET "related_to" = $1, "updated_at" = $2 WHERE "articles"."id" = $3  [["related_to", "444"], ["updated_at", "2020-09-18 10:16:30.305732"], ["id", 6]]