app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
---
  def index
    #@posts = Post.all
    @posts = Post.search(params[:search])

INSERT INTO "posts" ("author", "title", "body", "tags", "published", "published_on", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save